Revit 2024 API
InitialIntensity Class
 This class is the base class for calculating lighting initial intensity.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class InitialIntensity : IDisposable
Visual Basic
Public Class InitialIntensity _
	Implements IDisposable
Visual C++
public ref class InitialIntensity : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.InitialIntensity
 Autodesk.Revit.DB.Lighting.InitialFluxIntensity
 Autodesk.Revit.DB.Lighting.InitialIlluminanceIntensity
 Autodesk.Revit.DB.Lighting.InitialLuminousIntensity
 Autodesk.Revit.DB.Lighting.InitialWattageIntensity
See Also
InitialIntensity Members
Autodesk.Revit.DB.Lighting Namespace